'''
在真实的开发环境中，我们需要调用服务器采用或者写好的WSGI接口，

在本次Python演示中，暂时使用wsgiref模块来模拟WSGI接口
'''

__author__ = '伟大的小熊猫'

from wsgiref.simple_server import make_server
from process_data import application

httpd = make_server('', 8000, application)
#这个参数入口就叫做WSGI接口，实现它的模块就叫做WSGI服务器，或者叫做接口模块
httpd.serve_forever()
#服务器，启动！

                                                                                                                                                                     
                                                                                                                                                                                
            #         服务器把数据的加工分为两部分前面的解析和大包被称为WSGI服务，后面专门负责处理数据                                                                                                                  
            #         两者分开，一方面加快了开发进度；另一方面，WSGI保证了结构结果相同，保证了代码的可迁移性                                                                                                               
            #                                                |                                                                                                                    
            #                                                |                           -                                                                                        
            #                                                |                                                                                                              ----->
            #                          +------------------------------------------+                                                                                               
            #   +------------+         |  +----------------+                      |       +                                                                                       
            #   |            |         |  |                |                      |                                                                                               
            #   |            |         |  |  +----------+  |                      |                                                                                               
            #   |            ----------|---->|   解析     --------------+         |                                                                                               
            #   |            |         |  |  +----------+  |          |           |                                                                                               
            #   |     客     |         |  |                |    +-----|----+      |                                                                                               
            #   |     户     |         |  |                |    |   处理     |    |                                                                                               
            #   |     端     |         |  |                |    |   数据     |    |                                                                                               
            #   |            |         |  |                |    +-----|----+      |                                                                                               
            #   |            |         |  |  +----------+  |          |           |                                                                                               
            #   |            <---------|-----|   打包     <-------------+         |                                                                                               
            #   |            |         |  |  +----------+  |                      |                                                                                               
            #   |            |         |  |                |                      |                                                                                               
            #   +------------+         |  +----------------+                      |                                                                                               
            #                          +------------------------------------------+   